[{"votes": {"funny": 1, "useful": 2, "cool": 2}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "fZIKNRMfZ86yrmwWYuib-Q", "text": "Wow, what a disappointment!  I was not impressed with this place.  It was the night of the NCAA BB Finals and the front bar was too packed.  We went to the the back room and small patio area to join some friends who were part of a large party.  \n\nThere was hardly any room back there either and the server ignored us for most of the night.  We had to serve ourselves by going into the bar.  We also had to bus our own tables because nobody came out to clean up.  Also, the back room was very muggy and humid....this can't be the first time they've done large parties, right?!\n\nLike I said, I expected more out of this place and left disappointed.\n\nReturn Factor - 10%", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 2, "date": "2011-04-15", "_id": {"$oid": "564b90227388471cfc46e612"}, "type": "review"}, 
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "3RVdcl6DzMQNtNYTbgM8rA", "text": "Upgrading this place 1 Star.  Over the past couple of years, we've dropped by here after a game (Suns/Dbacks/Rattlers).  It's a fun place to come and hangout and have a nightcap.\n\nAfter Rattlers games, the team will come and party with the fans in the back room.  Those guys are super cool and the atmosphere is fun.\n\nReturn Factor - 75%", "business_id": "45puCRQ6Vh_IIAy7kkfFDQ", "stars": 3, "date": "2013-10-17", "_id": {"$oid": "564b90227388471cfc46e64a"}, "type": "review"}, 
{"votes": {"funny": 0, "useful": 2, "cool": 2}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "s1pvIpHVzzHvWYZj9i4KVQ", "text": "Live 101.5 or is it 101.5 JAMZ?  I think it just changed names...but the music has been the same for the past few years since I moved to town.  It's a Top 40 station and I listen to it from time to time.  Some of my friends like listening to Lady La.  I personally don't care for on-air personalities, so I change the station when they come on.  I've been to some remotes though and she's pretty cool in person.\n\nThey play all of the new top songs and it can get repetitive and predictable, but it's nice to listen it from time to time.\n\nReturn Factor - 75%", "business_id": "424HyHMwienlGfTp9Bj9BA", "stars": 3, "date": "2013-10-22", "_id": {"$oid": "564b90227388471cfc46ecfc"}, "type": "review"}, 
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "dzORwWfg3uDcCWWj37jFoQ", "text": "When I'm looking to calm down and relax, this is a station that I'll tune into.  The tracks are a bit slow for me most of the time, but enjoy it on occasion.  I'll immediately tune out once a DJ starts to talk...not a fan of talking on a music radio station.\n\nReturn Factor - 50%", "business_id": "424HyHMwienlGfTp9Bj9BA", "stars": 3, "date": "2013-10-23", "_id": {"$oid": "564b90227388471cfc46ecfd"}, "type": "review"}, 
{"votes": {"funny": 0, "useful": 2, "cool": 3}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "ESSqprLRgnVySivG8XdoDw", "text": "KMLE Country is one of my fav's to listen to.  They play modern country music, not that \"twangy\" old school country stuff....not to say that's bad, but I'd rather listen to the newer stuff.\n\nAlso, they put on some great events with Country Thunder and the 8 Man Jam.  Both of those events rock!\n\nReturn Factor - 90%", "business_id": "lW8-lFQ-mwG-Wl6iUKoT6g", "stars": 4, "date": "2013-10-23", "_id": {"$oid": "564b90227388471cfc46ed08"}, "type": "review"}, 
{"votes": {"funny": 0, "useful": 1, "cool": 1}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "F5onSH9KvN_RSaq4UTDI0Q", "text": "I've been to several events/conferences at the Phoenix Convention Center.  The facility is nice and modern with spacious pre-function areas and a nice selection of food options.  There's a Crust Pizza that serves up Pastas and Pizza for quick eats.  That's my favorite outlet to grab lunch or a snack if I don't like what the conference meal program offers.\nhttp://www.yelp.com/biz_photos/phoenix-convention-center-phoenix?select=8z7f14l2NjninBjZ-R7Tpw#8z7f14l2NjninBjZ-R7Tpw\n\nThe worst part about attending an event here is the parking.  Your choices are underground self parking garages that range from $6-$12 per day.or if the conference/event pays for a valet service, you might have that option for a fee.  There's also parking at area hotels that costs $ too and can be quite a walk. \n\nOnce you get inside it's easy to get turned around trying to figure out what side of the building you're on.  The directional signage is not very good.  It takes me a couple of days to get oriented when attending a large conference here.\n\nOverall, the experience is pretty average for a convention center.\n\nReturn Factor - 60%", "business_id": "F6BedoYgbAQHqwKX9F0zDQ", "stars": 3, "date": "2013-05-14", "_id": {"$oid": "564b90227388471cfc46edaf"}, "type": "review"}, 
{"votes": {"funny": 3, "useful": 6, "cool": 4}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "qw3_-Qbaj4yi8TdLDeLR9g", "text": "I've driven past this place many times on the way to Suns or D-Backs games.  Every time I passed by, it looked like a fun place to go hang out.  I finally had the opportunity to do so during a conference in downtown Phoenix.  One of the companies at the conference hosted a party here.\n\nThe party was staged in the patio area as you enter the restaurant.  The company who hosted the party was giving away complimentary Cigars, so I understand why they had it outdoors.  The weather was perfect, so it was a good time of the year to do it.  The place was packed too.  So why the 2 Stars?  Here's why:\n\n- They serve Wine out of a liquor gun....yes, they do.  When I went up to the bar on the patio and asked for a glass of Cabernet, the bartender told me \"You have to go inside because we don't have the handles with the Wine\".....I thought she was kidding and I said, \"I'm sorry, I don't think you understand, I asked for a glass of Cabernet.  You don't have any bottles back there?\"....that's when she confirmed what I heard and said \"No, you heard me right, we serve Wine out of a handle/line and since we're a smaller bar outside you have to go inside to get it\".......what the hell?!  The Wine tasted like what you would expect Wine from a tap to taste like...\n\n- The restrooms are like gas station restrooms.  They're located out next to the bars on the patio and they are just like gas station restrooms in that they're too small and dirty.  They couldn't handle the crowd of people at the party.\n\n- Service is slow.  The line at the bar was 30 people deep for each line (2 lines).  There were only 2 bartenders to service 200+ people.  It took 20+ min to get a drink.\n\n- The party felt like a house party in someone's backyard.  Plastic cups, plastic furniture, you had to bus your own table.....there were no buspersons or anyone to clean up.  Bizzaro-world.....\n\nOverall, not a good experience.  Maybe if I was a young 20 yr old it would be cool...not now.\n\nReturn Factor - 5%", "business_id": "oCA2OZcd_Jo_ggVmUx3WVw", "stars": 2, "date": "2013-04-21", "_id": {"$oid": "564b90227388471cfc46f0e3"}, "type": "review"}, 
{"votes": {"funny": 4, "useful": 7, "cool": 5}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "JwfuZxW3G1feypkEg0Bp0g", "text": "Watched a Suns game here recently and had a blast.  The arena is in the heart of Downtown Phoenix and is near bars and restaurants.  It's really easy to have a pre and post-game party.  We walked to Lucky Strikes after the game and had a few drinks and shot some pool.\n\nOverall, it's a good time in this arena.\n\nReturn Factor - 90%", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 4, "date": "2011-04-23", "_id": {"$oid": "564b90227388471cfc46f193"}, "type": "review"}, 
{"votes": {"funny": 0, "useful": 0, "cool": 0}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "oervcbDHgk5yvSwnhnPyYQ", "text": "Time for a review update.  Since my last review, I've come to several Suns games, Rattlers games, concerts, and a NCAA Sweet 16.  This arena is a great place to watch these events.\n\nThey have Cold Stone &  Streets of NY Pizza in the concession stands.  The parking is easy in/out when you park in any of the parking garages surrounding the arena.  After the event, you can go to one of many bars in the surrounding area.  We'll keep coming back.\n\nReturn Factor - 100%", "business_id": "uFJwKlHL6HyHSJmORO8-5w", "stars": 4, "date": "2013-10-17", "_id": {"$oid": "564b90227388471cfc46f1c1"}, "type": "review"}, 
{"votes": {"funny": 2, "useful": 4, "cool": 3}, "user_id": "kGgAARL2UmvCcTRfiscjug", "review_id": "h4FHKwof0XUS-sa3fEWDWw", "text": "I read about their Operation Santa Claus holiday charity campaign via friends on Yelp (thanks Jolly!) and called in to make a donation to help those in need.  I am always impressed when a media outlet gives up their airtime to support a local charity....kudos to the team @ ABC 15 for putting together this event!", "business_id": "4YY3AwkTbKQ2tJLzpYFD7w", "stars": 4, "date": "2013-12-11", "_id": {"$oid": "564b90227388471cfc46fecf"}, "type": "review"}]